cases/4x/6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-3 0 0)
    (15 0 0)
    (15 3 0)
    (-3 3 0)
    (-3 0 5)
    (15 0 5)
    (15 3 5)
    (-3 3 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (18 3 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    right
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
